src/InformationRegisters/СоответствияОрганизацийПартнеров/СоответствияОрганизацийПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствияОрганизацийПартнеров</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПартнерИнформирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПартнерОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Недействующий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнер</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/HTTPServices/Договоры/Module.bsl
Функция dogApiМетод(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ОтносительнаяЧастьURL",Запрос.ОтносительныйURL);
	СтруктураОтвета.Вставить("ПраметрЗапроса",Запрос.ПараметрыURL.Получить("ИмяМетода"));
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоответствияОрганизацийПартнеровСрезПоследних.Период,
		|	СоответствияОрганизацийПартнеровСрезПоследних.Организация,
		|	СоответствияОрганизацийПартнеровСрезПоследних.Партнер,
		|	СоответствияОрганизацийПартнеровСрезПоследних.ПартнерИнформирования,
		|	СоответствияОрганизацийПартнеровСрезПоследних.ПартнерОбработки,
		|	СоответствияОрганизацийПартнеровСрезПоследних.Недействующий
		|ИЗ
		|	РегистрСведений.СоответствияОрганизацийПартнеров.СрезПоследних КАК СоответствияОрганизацийПартнеровСрезПоследних
		|ГДЕ
		|	СоответствияОрганизацийПартнеровСрезПоследних.Недействующий = Ложь";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Партнеры = Новый Массив();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Партнеры.Добавить(ВыборкаДетальныеЗаписи.Партнер.Наименование);
	КонецЦикла;
	СтруктураОтвета.Вставить("Партнеры",Партнеры);
	ПотокВПамяти = Новый ПотокВПамяти;
	ЗаписьJson = Новый ЗаписьJSON();
	ЗаписьJson.ОткрытьПоток(ПотокВПамяти, КодировкаТекста.UTF8, Ложь);
	ЗаписатьJSON(ЗаписьJson, СтруктураОтвета);
	ЗаписьJson.Закрыть();
	ДД = ПотокВПамяти.ЗакрытьИПолучитьДвоичныеДанные();	
	Ответ.Заголовки.Вставить("Content-Type","application/json");
	Ответ.УстановитьТелоИзДвоичныхДанных(ДД);
	Возврат Ответ;
КонецФункции
